# Вариант 23. Дано целое число, большее 999. Используя одну операцию деления пацело
# и одну операцию взятия остатка от деления,
# найти цифру, соответствующую разряду тысяч в записи этого числа.


# Конструкция для обработки ошибки, если ввести не число
try:
    # Пользователь вводит целое число
    number = int(input("Введите число, большее 999: "))

    # Проверяем корректность диапазона числа, согласно условию
    if number <= 999:
        print("Вы ввели некорректное число.")
    else:
        # Вычисляем цифру в разряде тысяч и выводим результат
        result = (number // 1000) % 10
        print(result)

except ValueError:
    # Обрабатываем ошибку, если пользователь ввел не число
    print("Ошибка! Вы ввели не целое число.")
